Tekla.Structures.Model.Task
The Task class defines a single building site task. It may contain parts, assemblies or other tasks. Tasks may
have a hierarchy between them i.e. there are other tasks as subtasks for a parent task. Tasks may also
depend on each other, have resources assigned to them or have a single worktype.
The following example creates and inserts a task with two beams as objects into the model.
The task has also a scenario:
using System.Collections.Generic;
using System.Collections;
using System;
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
Point Point1 = new Point(0, 0, 0);
Point Point2 = new Point(1000, 0, 0);
Point Point3 = new Point(0, 1000, 0);
Point Point4 = new Point(1000, 1000, 0);
Beam Beam1 = new Beam(Point1, Point2);
Beam Beam2 = new Beam(Point3, Point4);
Beam1.Profile.ProfileString = "HEA400";
Beam1.Finish = "PAINT";
Beam1.Material.MaterialString = "S235JR";
Beam2.Profile.ProfileString = "HEA400";
Beam2.Finish = "PAINT";
Beam2.Material.MaterialString = "S235JR";
Beam1.Insert();
Beam2.Insert();
// The Task
Task Task1 = new Task();
Task1.PlannedStartDate = DateTime.Now;
Task1.Name = "Test Task";
Task1.Critical = true;
Task1.Description = "Test task description";
Task1.Url = "http://test.task.url";
// Scenario
HierarchicDefinition ScenarioDefinition = new HierarchicDefinition();
ScenarioDefinition.Name = "Scenario type";
ScenarioDefinition.HierarchyType = HierarchicDefinitionTypeEnum.DOT_HIERARCHIC_TASK_SCENARIO;
ScenarioDefinition.Insert();
HierarchicObject Scenario = new HierarchicObject();
Scenario.Name = "Current scenario";
Scenario.Definition = ScenarioDefinition;
Scenario.Insert();
Task1.Scenario = Scenario;
ArrayList ModelObjects = new ArrayList();
ModelObjects.Add(Beam1);
ModelObjects.Add(Beam2);
Task1.AddObjectsToTask(ModelObjects);
Task1.Insert();
}
}
Tekla.Structures.Model.TaskDependency
Tekla.Structures.Model.TaskWorktype

Tekla.Structures.Model.Task.SELECT_MAX_SIZE
Maximum amount of elements in one function call.

Tekla.Structures.Model.Task.Name
The name of the task.

Tekla.Structures.Model.Task.Completeness
The percentage of the completeness of the task on the scale from 0 to 100.

Tekla.Structures.Model.Task.Critical
The criticality of the task.

Tekla.Structures.Model.Task.Local
The locality indicates if the task was created in Tekla Structures and Task Manager or imported.

Tekla.Structures.Model.Task.Scenario
The scenario which the task belongs to.

Tekla.Structures.Model.Task.Description
A short textual description of the task.

Tekla.Structures.Model.Task.Url
A link to material or data related to the task. The link can be a hyperlink or a file system link.

Tekla.Structures.Model.Task.PlannedStartDate
The planned start date of the task.

Tekla.Structures.Model.Task.PlannedEndDate
The planned end date of the task.

Tekla.Structures.Model.Task.PlannedWorkAmount
The amount of work planned to be used for the task.

Tekla.Structures.Model.Task.ActualStartDate
The actual start date of the task.

Tekla.Structures.Model.Task.ActualEndDate
The actual end date of the task.

Tekla.Structures.Model.Task.ActualWorkAmount
The amount of work already used for the task.

Tekla.Structures.Model.Task.#ctor
Creates a new task instance.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System.Collections;
public class Example
{
public void Example1()
{
bool Result = false;
Beam Beam1 = new Beam(new Point(0, 0, 0), new Point(1000, 0, 0));
Beam Beam2 = new Beam(new Point(0, 500, 0), new Point(1000, 500, 0));
Beam1.Name = "Default Beam 0000";
Beam2.Name = "Default Beam 0001";
Beam1.Insert();
Beam2.Insert();
Task Task1 = new Task();
Task1.Name = "Default Task 0000";
Task1.Insert();
ArrayList aChildren = new ArrayList();
aChildren.Add(Beam1);
aChildren.Add(Beam2);
Result = Task1.AddObjectsToTask(aChildren);
}
}

Tekla.Structures.Model.Task.#ctor(Tekla.Structures.Identifier)
Creates a task instance with a known identifier. Select the task after the creation.
ID: The identifier of an existing task.
using Tekla.Structures.Model;
using Tekla.Structures;
public class Example
{
public void Example1()
{
Identifier Identifier1 = new Identifier(357);
bool Result = true;
Task Task1 = new Task(Identifier1);
Task1.Select();
ModelObjectEnumerator TaskChildren = Task1.GetChildren();
foreach (Task ChildTask in TaskChildren)
{
ChildTask.Name += " (modified)";
Result = ChildTask.Modify();
}
}
}

Tekla.Structures.Model.Task.Insert
Inserts the task instance in the model.
Returns: True on success.

Tekla.Structures.Model.Task.Select
Selects the task instance from the model. The identifier must be set.
Returns: True on success.

Tekla.Structures.Model.Task.Modify
Modifies the task instance in the model. The identifier must be set.
Returns: True on success.

Tekla.Structures.Model.Task.Delete
Deletes the task instance from the model. The identifier must be set.
Returns: True on success.

Tekla.Structures.Model.Task.AddObjectsToTask(System.Collections.ArrayList)
Adds objects to the task.
ModelObjects: An array list of model objects to be added to the task.
Returns: True on success.
using Tekla.Structures.Model;
using System.Collections;
public class Example
{
public void Example1()
{
// Add beam1 and beam2 into the task.
Task task = new Task();
Beam beam1 = new Beam();
Beam beam2 = new Beam();
if (task.Insert() &&
beam1.Insert() &&
beam2.Insert())
{
ArrayList objectsToAdd = new ArrayList();
objectsToAdd.Add(beam1);
objectsToAdd.Add(beam2);
task.AddObjectsToTask(objectsToAdd);
}
}
}

Tekla.Structures.Model.Task.RemoveObjectsFromTask(System.Collections.ArrayList)
Removes objects from the task.
ModelObjects: An array list of model objects to be removed from the task.
Returns: True on success.
using Tekla.Structures.Model;
using Tekla.Structures;
using System.Collections;
public class Example
{
public void Example1()
{
Identifier Identifier1 = new Identifier(357);
// Remove all the children from the task.
Task task = new Task(Identifier1);
if (task.Select())
{
ModelObjectEnumerator taskChildren = task.GetChildren();
ArrayList objectsToRemove = new ArrayList();
while (taskChildren.Current != null)
objectsToRemove.Add(taskChildren.Current);
task.RemoveObjectsFromTask(objectsToRemove);
}
}
}

Tekla.Structures.Model.Task.GetFathers
Returns an enumerator of all the task type fathers for the task object.
Returns: A model object enumerator on success, otherwise null.

Tekla.Structures.Model.Task.GetDependencies
Returns an enumerator of all the task dependency objects where the task is involved.
Returns: A model object enumerator on success, otherwise null.

Tekla.Structures.Model.Task.GetAllTasksOfSelectedObjects
Returns an enumerator of all the tasks related to the selected objects.
Returns: A model object enumerator on success, otherwise null.

Tekla.Structures.Model.Task.DoAttachObjectsToTask(System.Collections.ArrayList,System.Boolean)
Adds a list of objects to this task.
ModelObjects: List of ModelObjects
Attach: True to attach, false to detach
Returns: Success